OpenFlashlightPlatform/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Blue Sun (Native USB Port)
# ---------------------------------------
bluesun_native.name=BlueSun OFP
bluesun_native.vid.0=0x2341
bluesun_native.pid.0=0x004d

bluesun_native.upload.tool=bossac
bluesun_native.upload.protocol=sam-ba
bluesun_native.upload.maximum_size=262144
bluesun_native.upload.use_1200bps_touch=true
bluesun_native.upload.wait_for_upload_port=true
bluesun_native.upload.native_usb=true
bluesun_native.build.mcu=cortex-m0plus
bluesun_native.build.f_cpu=48000000L
bluesun_native.build.usb_product="BlueSun OFP"
bluesun_native.build.usb_manufacturer="AvE Community"
bluesun_native.build.board=SAMD_ZERO
bluesun_native.build.core=arduino
bluesun_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
bluesun_native.build.variant=bluesun
bluesun_native.build.variant_system_lib=
bluesun_native.build.vid=0x2341
bluesun_native.build.pid=0x004d
